[ {
        "name": "NOPE",
                "contents": 
                [{
                    "ImgPath":"..\/Project Images\/Arlo_Placeholder.png",
                    "ImgStyle": "width: 494px;height: 278px",
                    "Subtitle": 
                    [{
                        "ItchPath":  "NOPE",
                        "Position": "NOPE"
                    }],
                    "Desc":
                    [{
                        "Type": "NOPE",
                        "PlayType": "CANT PLAY IT",
                        "Synopsis": "NOPE",
                        "Synopsis2": "NOPE2",
                        "Work": 
                        [{
                            "Design": "Nope",
                            "Programming": " NOPE",
                            "UI": "NOOPE"
                        }]
                    }],
                    "Steps": "NONE",
                    "Des_Think": "DIDN't"
                        
                }]
    },
    {
        "name": "Lucky",
                "contents": 
                [{
                    "ImgPath":"..\/Project Images\/Lucky.png",
                    "ImgStyle": "width: 494px;height: 278px",
                    "Subtitle": 
                    [{
                        "ItchPath":  "https://citlalli-h.itch.io/lucky",
                        "Position": "Programmer - 2023"
                    }],
                    "Desc":
                    [{
                        "Type": "DeckBuilder, TurnBased RPG",
                        "PlayType": "Downloadable on Itch.io",
                        "Synopsis": "This game was developed for UCSC CMPM 173 Game Design Studio III as a Senior Project. The process of brainstorming, developing, prototyping, and final prototype was developed in 10 weeks. The game had to be fairly finished and playable to then be showed in the schools digital showcase. I was a part of a small group of 6 people who all worked on developing this game.",
                        "Synopsis2": "Since we wanted to make a gambling slot machine game we struggled in accurately creating that feeling, wihout being too overwhelming. There where also many outside challenged faced as we where all in our senior year, dealing with time constraints, jobs, and otherclasses.",
                        "Work": 
                        [{
                            "Design": "Helped develop the Main Scenario and World",
                            "Programming": "Part of a small team that helepd develop the game. Developed a Slot Machine Mechanic, Combat System,Dialogue System, Card Interactions, Item usage, Dictionary, etc.",
                            "UI":"Helped develop and program Menu Page,Credit Page and Menu Page Navigation"
                        }]
                    }],
                    "Steps": "Every group (art, design, narrative, programming) would research their tasks respectively, and have meetings with other groups if needed. For programming we prototyped and researched systems and classes that would help us develop and add features more smoothly.",
                    "Des_Think": "Over a series of 7 weeks a few developers, including myself, would reguarly playtest, or ask others in my class for opinions and thoughts for certain feature's we where unsure of. Within the next days we would implement those ideas and return to playtest the next week. Our team followed the SCRUM process to keep ourself steadily moving foward"
                }]
    },
    {
        "name": "You Are A Ghost",
                "contents": 
                [{
                    "ImgPath":"..\/Project Images\/YouAreAGhost.png",
                    "ImgStyle": "width: 494px;height: 278px",
                    "Subtitle": 
                    [{
                        "ItchPath":  "https://citlalli-h.itch.io/you-are-a-ghost",
                        "Position": "Lead Programmer - 2022"
                    }],
                    "Desc":
                    [{
                        "Type": "Point and Click, Interactive Narrative",
                        "PlayType": "Downloadable on Itch.io",
                        "Synopsis": "This game was developed for UCSC CMPM 172 Game Design Studio II as a Senior Project. The process of brainstorming, developing, prototyping, and final prototype was developed in 10 weeks. The game had to be fairly finished and playable to then be showed in the schools in-person showcase. I was a part of a small group of 4 people who all worked on developing this game.",
                        "Synopsis2": "This was the first Game I developed in Unity and had to overcome that obstacled faced when learning a new tool. In addition the team was small and busy so development was slow. Outside challenges such as power outages and construction, jobs and time constraints also deterred development. The final outcome was different than planned, yet still something we are proud of. ",
                        "Work": 
                        [{
                            "Design": "Helped develop the Main Scenario",
                            "Programming": "Worked with Technical Designer to Program most gameplay aspects of game. Programmed Pathfinding, Dialogue, SpeechBubbles, etc. ",
                            "UI": "Worked on Main Menu and Navigation"
                        }]
                    }],
                    "Steps": "Each person talked and met with others if needed. I met often with the technical designer to work on the project together and discuss systems we can incorporate into the game and how.",
                    "Des_Think": "The last 2 weeks we playtested to get a feel for how the player interacts with the setting and if they would stray from the story. We used the SCRUM system to help push our development foward."

                }]
    },
    {
        "name": "Radical Witch",
                "contents": 
                [{
                    "ImgPath":"..\/Project Images\/RadicalWitch.png",
                    "ImgStyle": "width: 494px;height: 278px",
                    "Subtitle": 
                    [{
                        "ItchPath":  "https://samuraimantis.itch.io/radical-witch",
                        "Position": "Programmer-2021"
                    }],
                    "Desc":
                    [{
                        "Type": "Action, Endless Runner",
                        "PlayType": "Play in Browser on Itch.io",
                        "Synopsis": "This game was developed for a UCSC undergraduate game development class. It was designed, prototype, and developed in under 5 weeks. This game was cleaned up later by the other programmer and put on Itch.io",
                        "Synopsis2": "The small development team and time constraint posed a challenge. ",
                        "Work": 
                        [{
                            "Design": " ",
                            "Programming": "Part of a small team of Developers, Developed the Ghost Spawner and Point system",
                            "UI": "Developed Main Menu and Navigation"
                        }]
                    }],
                    "Steps": "We had a list of tasks we would frequently update eachother on inorder to make development run smoothly. The producer made sure to often check in and see that we were keeping up with the tasks; aswell as, providing feedback on anything that needed to be edited.",
                    "Des_Think": "We would protype with other classmates and teachers assistants and bring documents together to discuss and talk about in changes that needed to be made."

                }]
    },
    {
        "name": "Edge of Detection",
                "contents": 
                [{
                    "ImgPath":"..\/Project Images\/EdgeOfDetection.png",
                    "ImgStyle": "width: 494px;height: 278px",
                    "Subtitle": 
                    [{
                        "ItchPath":  "https://citlalli-h.itch.io/edge-of-detection",
                        "Position": "Programmer-2022"
                    }],
                    "Desc":
                    [{
                        "Type": "Stealth Platformer",
                        "PlayType": "Play in Browser on Itch.io",
                        "Synopsis": "This game was developed for a UCSC undergraduate game development class. It was designed, prototype, and developed in under 5 weeks.",
                        "Synopsis2": "The small development team and time constraint posed a challenge. ",
                        "Work": 
                        [{
                            "Design": "Helped develop the Main Scenario",
                            "Programming": " Developed Detection system (with Raycast), Helped create SFX",
                            "UI": "Helped develop Main Menu and Navigation"
                        }]
                    }],
                    "Steps": "We had a list of tasks we would frequently update eachother on inorder to make development run smoothly. The producer made sure to often check in and see that we were keeping up with the tasks; aswell as, providing feedback on anything that needed to be edited.",
                    "Des_Think": "We would protype with other classmates and teachers assistants and bring documents together to discuss and talk about in changes that needed to be made."
                }]
    },
    {
        "name": "Nightfall",
                "contents": 
                [{
                    "ImgPath":"..\/Project Images\/Nightfall.png",
                    "ImgStyle": "width: 494px;height: 278px",
                    "Subtitle": 
                    [{
                        "ItchPath":  "https://citlalli-h.itch.io/nightfall",
                        "Position": "Programmer - 2023"
                    }],
                    "Desc":
                    [{
                        "Type": "Narrative, Interactive Fiction",
                        "PlayType": "Playable on Itch.io",
                        "Synopsis": "This game was developed for UCSC CMPM 170 Game Design Studio I as a Senior Project. The process of brainstorming, developing, prototyping, and final prototype was developed in 1 week. The game had to be fairly finished and playable to then be showed in a presentation. I was a part of a small group of 2 people who worked on developing this game.",
                        "Synopsis2": "There where two main issues during development. Firstly, the game could only allow the player to use one button. We struggled in where we could implement the button in the game, aswell as making mechanics simple but entertaining enough to fit our game. Secondly, this project was time constraints such as jobs and otherclasses.",
                        "Work": 
                        [{
                            "Design": "Helped develop the mechanic",
                            "Programming": "Developed the game fully using the crisp-game-lib library",
                            "UI":"Develop the menu"
                        }]
                    }],
                    "Steps": "I checked in on progress with the narrative designer, and kept him up-to-date on the state of the game. We took feedback from others to improve the game where we could.",
                    "Des_Think": " "
                }]
    }
    
]